## 10 minutes to pandas
###### pandas website
https://pandas.pydata.org/
###### 10 mins to pandas link
https://pandas.pydata.org/docs/user_guide/10min.html
###### short cuts
https://www.dataquest.io/blog/jupyter-notebook-tips-tricks-shortcuts/

In [35]:
import numpy as np

In [36]:
import pandas as pd

###### creation of a pandas list

In [37]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [38]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

###### Creation of a simple dataframe. 
###### First we create a date range (yyyy-mm-dd)

In [39]:
dates = pd.date_range("20130101", periods=7)

In [40]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07'],
              dtype='datetime64[ns]', freq='D')

###### Then we create a randomly generated 7 by 4 matrix and supply

In [41]:
df = pd.DataFrame(np.random.randn(7, 4))

In [42]:
df

          0         1         2         3
0  0.590172 -1.241467 -0.162137  0.161641
1 -1.230647 -0.620835  0.953211  0.050281
2 -0.530537 -1.671200  0.440738  0.827747
3 -0.093576  0.426849  0.350101  1.645887
4  0.039224 -0.164646  0.354975 -0.031507
5 -0.195507  0.297896 -1.413650  0.108494
6  0.448963  2.297716 -0.122429 -0.736057

###### placing a matrix into a pandas dataframe with the dates and adding column headers

In [43]:
df1=pd.DataFrame(np.random.rand(7,4), index=dates,columns=list("ABCD"))
df1

                   A         B         C         D
2013-01-01  0.723503  0.021391  0.809233  0.456858
2013-01-02  0.371103  0.332598  0.101274  0.527121
2013-01-03  0.853208  0.885376  0.399281  0.104243
2013-01-04  0.115003  0.678397  0.608275  0.508568
2013-01-05  0.765152  0.335116  0.208562  0.870510
2013-01-06  0.904287  0.806757  0.874528  0.081245
2013-01-07  0.504531  0.910296  0.676516  0.968643

###### Pandas can handle multiple date types in a single table

In [45]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

###### The data types in df2 are given below, 1 from the top and 2 from the bottom

In [48]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

92)###### viewing the top and bottom of a table

In [52]:
df2.head(1)

     A          B    C  D     E    F
0  1.0 2013-01-02  1.0  3  test  foo

In [53]:
df2.tail(2)

     A          B    C  D      E    F
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

###### To dsisplay a particular column just

In [56]:
df1.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07'],
              dtype='datetime64[ns]', freq='D')

In [57]:
df1.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

###### You can convert the pandas frame into Numpy but for tables containing more than one data type the operation is expensive

In [58]:
df1.to_numpy()

array([[0.72350305, 0.02139053, 0.80923338, 0.45685845],
       [0.37110289, 0.33259777, 0.10127419, 0.52712088],
       [0.85320815, 0.88537647, 0.39928056, 0.10424302],
       [0.11500316, 0.67839676, 0.6082752 , 0.50856754],
       [0.765152  , 0.33511577, 0.2085617 , 0.87050969],
       [0.90428665, 0.80675655, 0.87452761, 0.08124526],
       [0.50453077, 0.91029642, 0.67651569, 0.96864299]])

In [60]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [ ]:
###### A set of summary stats for the frame

In [62]:
df1.describe()

              A         B         C         D
count  7.000000  7.000000  7.000000  7.000000
mean   0.605255  0.567133  0.525381  0.502455
std    0.287451  0.340468  0.296741  0.339488
min    0.115003  0.021391  0.101274  0.081245
25%    0.437817  0.333857  0.303921  0.280551
50%    0.723503  0.678397  0.608275  0.508568
75%    0.809180  0.846067  0.742875  0.698815
max    0.904287  0.910296  0.874528  0.968643

In [63]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

###### To transpose df1

In [74]:
df1

                   A         B         C         D
2013-01-01  0.723503  0.021391  0.809233  0.456858
2013-01-02  0.371103  0.332598  0.101274  0.527121
2013-01-03  0.853208  0.885376  0.399281  0.104243
2013-01-04  0.115003  0.678397  0.608275  0.508568
2013-01-05  0.765152  0.335116  0.208562  0.870510
2013-01-06  0.904287  0.806757  0.874528  0.081245
2013-01-07  0.504531  0.910296  0.676516  0.968643

In [79]:
df1.T

,2013-01-01,2013-01-02,2013-01-03,2013-01-04,2013-01-05,2013-01-06,2013-01-07
A,0.723503,0.371103,0.853208,0.115003,0.765152,0.904287,0.504531
B,0.021391,0.332598,0.885376,0.678397,0.335116,0.806757,0.910296
C,0.809233,0.101274,0.399281,0.608275,0.208562,0.874528,0.676516
D,0.456858,0.527121,0.104243,0.508568,0.870510,0.081245,0.968643

###### Sort types

In [80]:
df1.sort_index(axis=1, ascending =False)

                   D         C         B         A
2013-01-01  0.456858  0.809233  0.021391  0.723503
2013-01-02  0.527121  0.101274  0.332598  0.371103
2013-01-03  0.104243  0.399281  0.885376  0.853208
2013-01-04  0.508568  0.608275  0.678397  0.115003
2013-01-05  0.870510  0.208562  0.335116  0.765152
2013-01-06  0.081245  0.874528  0.806757  0.904287
2013-01-07  0.968643  0.676516  0.910296  0.504531

In [82]:
df1.sort_values(by="B")

                   A         B         C         D
2013-01-01  0.723503  0.021391  0.809233  0.456858
2013-01-02  0.371103  0.332598  0.101274  0.527121
2013-01-05  0.765152  0.335116  0.208562  0.870510
2013-01-04  0.115003  0.678397  0.608275  0.508568
2013-01-06  0.904287  0.806757  0.874528  0.081245
2013-01-03  0.853208  0.885376  0.399281  0.104243
2013-01-07  0.504531  0.910296  0.676516  0.968643

###### Collecting data from a column

In [84]:
df1["A"]

2013-01-01    0.723503
2013-01-02    0.371103
2013-01-03    0.853208
2013-01-04    0.115003
2013-01-05    0.765152
2013-01-06    0.904287
2013-01-07    0.504531
Freq: D, Name: A, dtype: float64

###### Using the columd data command with describe allows you to select asingle column for descriptive stats.

In [90]:
df1["A"].describe()

count    7.000000
mean     0.605255
std      0.287451
min      0.115003
25%      0.437817
50%      0.723503
75%      0.809180
max      0.904287
Name: A, dtype: float64

###### Taking slices by line and by date

In [91]:
df1[1:3]

                   A         B         C         D
2013-01-02  0.371103  0.332598  0.101274  0.527121
2013-01-03  0.853208  0.885376  0.399281  0.104243

In [93]:
df1["20130105":"20130106"]

                   A         B         C         D
2013-01-05  0.765152  0.335116  0.208562  0.870510
2013-01-06  0.904287  0.806757  0.874528  0.081245

###### taking a slice or slices

In [96]:
df1

                   A         B         C         D
2013-01-01  0.723503  0.021391  0.809233  0.456858
2013-01-02  0.371103  0.332598  0.101274  0.527121
2013-01-03  0.853208  0.885376  0.399281  0.104243
2013-01-04  0.115003  0.678397  0.608275  0.508568
2013-01-05  0.765152  0.335116  0.208562  0.870510
2013-01-06  0.904287  0.806757  0.874528  0.081245
2013-01-07  0.504531  0.910296  0.676516  0.968643

In [95]:
df1.loc[dates[0]]

A    0.723503
B    0.021391
C    0.809233
D    0.456858
Name: 2013-01-01 00:00:00, dtype: float64

In [103]:
df1.loc[dates[3]]

A    0.115003
B    0.678397
C    0.608275
D    0.508568
Name: 2013-01-04 00:00:00, dtype: float64

In [101]:
df1.loc[:,["A","C"]]

                   A         C
2013-01-01  0.723503  0.809233
2013-01-02  0.371103  0.101274
2013-01-03  0.853208  0.399281
2013-01-04  0.115003  0.608275
2013-01-05  0.765152  0.208562
2013-01-06  0.904287  0.874528
2013-01-07  0.504531  0.676516

In [105]:
df1.loc["20130107", ["A", "C"]]

A    0.504531
C    0.676516
Name: 2013-01-07 00:00:00, dtype: float64

In [106]:
df1.loc[dates[0], "A"]

0.7235030490459686

In [107]:
df1

                   A         B         C         D
2013-01-01  0.723503  0.021391  0.809233  0.456858
2013-01-02  0.371103  0.332598  0.101274  0.527121
2013-01-03  0.853208  0.885376  0.399281  0.104243
2013-01-04  0.115003  0.678397  0.608275  0.508568
2013-01-05  0.765152  0.335116  0.208562  0.870510
2013-01-06  0.904287  0.806757  0.874528  0.081245
2013-01-07  0.504531  0.910296  0.676516  0.968643

In [ ]:
###### selection by position

In [108]:
df1.iloc[4]

A    0.765152
B    0.335116
C    0.208562
D    0.870510
Name: 2013-01-05 00:00:00, dtype: float64

In [110]:
df1.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.115003  0.678397
2013-01-05  0.765152  0.335116

###### rows and positions

In [111]:
df1.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.371103  0.101274
2013-01-03  0.853208  0.399281
2013-01-05  0.765152  0.208562

###### slicing rows

In [113]:
df1.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.371103  0.332598  0.101274  0.527121
2013-01-03  0.853208  0.885376  0.399281  0.104243

###### Slicing columns

In [114]:
df1.iloc[:, 1:3]

                   B         C
2013-01-01  0.021391  0.809233
2013-01-02  0.332598  0.101274
2013-01-03  0.885376  0.399281
2013-01-04  0.678397  0.608275
2013-01-05  0.335116  0.208562
2013-01-06  0.806757  0.874528
2013-01-07  0.910296  0.676516

###### Explicit position

In [116]:
df1.iloc[1, 1]

0.33259776711107636

###### Boolean indexing

###### Select all data rows that has a column a value above 0.6

In [118]:
df1[df1["A"] > 0.6]

                   A         B         C         D
2013-01-01  0.723503  0.021391  0.809233  0.456858
2013-01-03  0.853208  0.885376  0.399281  0.104243
2013-01-05  0.765152  0.335116  0.208562  0.870510
2013-01-06  0.904287  0.806757  0.874528  0.081245

###### selecting only values that are greater than o.6

In [119]:
df1[df1 > 0.6]

                   A         B         C         D
2013-01-01  0.723503       NaN  0.809233       NaN
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03  0.853208  0.885376       NaN       NaN
2013-01-04       NaN  0.678397  0.608275       NaN
2013-01-05  0.765152       NaN       NaN  0.870510
2013-01-06  0.904287  0.806757  0.874528       NaN
2013-01-07       NaN  0.910296  0.676516  0.968643

###### using the isin method

In [120]:
df3= df1.copy()
df3

                   A         B         C         D
2013-01-01  0.723503  0.021391  0.809233  0.456858
2013-01-02  0.371103  0.332598  0.101274  0.527121
2013-01-03  0.853208  0.885376  0.399281  0.104243
2013-01-04  0.115003  0.678397  0.608275  0.508568
2013-01-05  0.765152  0.335116  0.208562  0.870510
2013-01-06  0.904287  0.806757  0.874528  0.081245
2013-01-07  0.504531  0.910296  0.676516  0.968643

In [125]:
df3["E"]=["big mac","big mac","quaterpounder","nuggets","fillet","fillet","quaterpounder"]
df3

                   A         B         C         D              E
2013-01-01  0.723503  0.021391  0.809233  0.456858        big mac
2013-01-02  0.371103  0.332598  0.101274  0.527121        big mac
2013-01-03  0.853208  0.885376  0.399281  0.104243  quaterpounder
2013-01-04  0.115003  0.678397  0.608275  0.508568        nuggets
2013-01-05  0.765152  0.335116  0.208562  0.870510         fillet
2013-01-06  0.904287  0.806757  0.874528  0.081245         fillet
2013-01-07  0.504531  0.910296  0.676516  0.968643  quaterpounder

In [126]:
df3[df3["E"].isin(["big mac", "fillet"])]

                   A         B         C         D        E
2013-01-01  0.723503  0.021391  0.809233  0.456858  big mac
2013-01-02  0.371103  0.332598  0.101274  0.527121  big mac
2013-01-05  0.765152  0.335116  0.208562  0.870510   fillet
2013-01-06  0.904287  0.806757  0.874528  0.081245   fillet

###### Setting

###### Missing data

###### Stats

In [127]:
df1.mean()

A    0.605255
B    0.567133
C    0.525381
D    0.502455
dtype: float64

###### Reverses the axis

In [129]:
df1.mean(1)

2013-01-01    0.502746
2013-01-02    0.333024
2013-01-03    0.560527
2013-01-04    0.477561
2013-01-05    0.544835
2013-01-06    0.666704
2013-01-07    0.764996
Freq: D, dtype: float64

###### need to back and have a look at the next two items to understnad applicability

In [138]:
s = pd.Series([1, 26, 5, 107, 6, 8,7], index=dates)
s

2013-01-01      1
2013-01-02     26
2013-01-03      5
2013-01-04    107
2013-01-05      6
2013-01-06      8
2013-01-07      7
Freq: D, dtype: int64

In [139]:
df1.sub(s, axis="index")

                     A           B           C           D
2013-01-01   -0.276497   -0.978609   -0.190767   -0.543142
2013-01-02  -25.628897  -25.667402  -25.898726  -25.472879
2013-01-03   -4.146792   -4.114624   -4.600719   -4.895757
2013-01-04 -106.884997 -106.321603 -106.391725 -106.491432
2013-01-05   -5.234848   -5.664884   -5.791438   -5.129490
2013-01-06   -7.095713   -7.193243   -7.125472   -7.918755
2013-01-07   -6.495469   -6.089704   -6.323484   -6.031357

###### End

###### Applying functions

In [141]:
df1

                   A         B         C         D
2013-01-01  0.723503  0.021391  0.809233  0.456858
2013-01-02  0.371103  0.332598  0.101274  0.527121
2013-01-03  0.853208  0.885376  0.399281  0.104243
2013-01-04  0.115003  0.678397  0.608275  0.508568
2013-01-05  0.765152  0.335116  0.208562  0.870510
2013-01-06  0.904287  0.806757  0.874528  0.081245
2013-01-07  0.504531  0.910296  0.676516  0.968643

In [143]:
df1.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.723503  0.021391  0.809233  0.456858
2013-01-02  1.094606  0.353988  0.910508  0.983979
2013-01-03  1.947814  1.239365  1.309788  1.088222
2013-01-04  2.062817  1.917762  1.918063  1.596790
2013-01-05  2.827969  2.252877  2.126625  2.467300
2013-01-06  3.732256  3.059634  3.001153  2.548545
2013-01-07  4.236787  3.969930  3.677668  3.517188

In [146]:
df1.apply(lambda x: x.max() - x.min())

A    0.789283
B    0.888906
C    0.773253
D    0.887398
dtype: float64

###### histogram

In [148]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    5
1    3
2    6
3    5
4    1
5    5
6    6
7    4
8    6
9    0
dtype: int32

In [149]:
s.value_counts()

5    3
6    3
0    1
1    1
3    1
4    1
dtype: int64

###### string methods

###### concatanation

In [151]:
df4=pd.DataFrame(np.random.randn(10,4))
df4

          0         1         2         3
0 -3.511781 -0.204420 -1.310105  0.056685
1  0.608578 -1.548106  0.818289 -0.974804
2  1.827146 -1.331414  0.332076  1.063474
3  0.923334  0.125454 -0.004026 -0.299527
4  0.180761  0.801819  0.477328 -1.004411
5 -1.666967  0.461001 -1.161745 -0.548670
6 -0.609257  0.379279  0.794312  0.447361
7 -0.263119  0.696575  2.171258  0.804362
8 -1.418844 -0.058978 -0.554523 -1.201517
9 -0.425420 -0.280063 -0.035894 -1.592509

In [158]:
bits=[df4[1:3],df4[5:7],df4[7:9]]
bits

[          0         1         2         3
 1  0.608578 -1.548106  0.818289 -0.974804
 2  1.827146 -1.331414  0.332076  1.063474,
           0         1         2         3
 5 -1.666967  0.461001 -1.161745 -0.548670
 6 -0.609257  0.379279  0.794312  0.447361,
           0         1         2         3
 7 -0.263119  0.696575  2.171258  0.804362
 8 -1.418844 -0.058978 -0.554523 -1.201517]

In [159]:
pd.concat(bits)

          0         1         2         3
1  0.608578 -1.548106  0.818289 -0.974804
2  1.827146 -1.331414  0.332076  1.063474
5 -1.666967  0.461001 -1.161745 -0.548670
6 -0.609257  0.379279  0.794312  0.447361
7 -0.263119  0.696575  2.171258  0.804362
8 -1.418844 -0.058978 -0.554523 -1.201517

###### join

In [161]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [162]:
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [163]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

###### Grouping

###### Reshaping

###### Time series

In [168]:
rng = pd.date_range("1/1/2012", periods=100, freq="S")

In [170]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [171]:
ts.resample("5Min").sum()

2012-01-01    25391
Freq: 5T, dtype: int32